# Pertemuan 2 Pandas

https://youtu.be/I_UeEB0Bj-I

#### mengembalikan urutan baris dan kolom pada data frame

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

#### Data Frame Awal

In [6]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size =(n_rows,n_cols)), 
                  columns = cols)
df

   A  B  C  D  E
0  2  4  4  5  5
1  7  6  2  9  4
2  4  7  3  9  5
3  3  2  2  5  6
4  6  6  9  3  8

####  membalik urutan kolom

In [8]:
df.loc[:, ::-1]

   E  D  C  B  A
0  5  5  4  4  2
1  4  9  2  6  7
2  5  9  3  7  4
3  6  5  2  2  3
4  8  3  9  6  6

#### Membalik urutan baris

In [9]:
df.loc[::-1]

   A  B  C  D  E
4  6  6  9  3  8
3  3  2  2  5  6
2  4  7  3  9  5
1  7  6  2  9  4
0  2  4  4  5  5

- df.loc : dibagi menjadi dua bagian besar `df.loc[mengatur baris, mengatur kolom]`
- -1 untuk mengatur stepper, bila -1 akan me-reserve.

#### Membalik urutan baris dan melakukan penyesuaian index

In [12]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  6  6  9  3  8
1  3  2  2  5  6
2  4  7  3  9  5
3  7  6  2  9  4
4  2  4  4  5  5

 `drop` = index lama akan dibuang atau urutan barisnya dibuat ulang ke awal. urutan barisnya akan tetap namun isi atau hasilnya akan berbuah

#### Mengganti nama kolom pada data frame

https://youtu.be/VQlBG5n3rOw

#### Data Frame awal

In [14]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size =(n_rows,n_cols)), 
                  columns = cols)
df

   A  B  C  D  E
0  7  7  4  3  2
1  8  3  9  8  8
2  4  9  5  4  8
3  7  7  4  6  1
4  5  5  4  9  8

#### Mengganti nama untuk sebuah kolom

In [15]:
df.rename(columns ={'C':'Hobi'})

   A  B  Hobi  D  E
0  7  7     4  3  2
1  8  3     9  8  8
2  4  9     5  4  8
3  7  7     4  6  1
4  5  5     4  9  8

`df.rename(columns ={'nama kolom yang mau di ganti':'nama baru kolom'})`

#### Mengganti nama untuk banyak kolom

In [16]:
df.rename(columns ={'A':'Nama','B':'Alamat','D':'Kota'})

   Nama  Alamat  C  Kota  E
0     7       7  4     3  2
1     8       3  9     8  8
2     4       9  5     4  8
3     7       7  4     6  1
4     5       5  4     9  8

untuk mengubah banyak kolom maka menggunakan dictionary di dalam fungsi rename.

df.rename(columns ={'nama awal 1':'nama baru 1', 'nama awal 2':'nama baru 2'})

#### menghapus (drop) missing value (NaN)

https://youtu.be/ZrGlfBnXyGY

In [18]:
df = pd.util.testing.makeMissingDataframe().reset_index()
df.head() #menampilkan 5 data pertama

        index         A         B         C         D
0  OMJZv5Hlpd -0.369576  0.282193 -0.152119  0.096821
1  hb39Oc2EAE       NaN       NaN  0.126455  0.608914
2  VUzaIaqpVp       NaN  0.057682  0.270354 -0.915022
3  yvCqamhMAR  0.544578  0.626010 -0.594372  0.816455
4  kowiYpC0An -0.044419  0.911803  0.711267  2.145084

In [23]:
df = df.rename(columns={'index':'Z'})
df.head()

            Z         A         B         C         D
0  OMJZv5Hlpd -0.369576  0.282193 -0.152119  0.096821
1  hb39Oc2EAE       NaN       NaN  0.126455  0.608914
2  VUzaIaqpVp       NaN  0.057682  0.270354 -0.915022
3  yvCqamhMAR  0.544578  0.626010 -0.594372  0.816455
4  kowiYpC0An -0.044419  0.911803  0.711267  2.145084

In [20]:
df_backup = df.copy(deep=True)

`df.copy(deep=True)` : untuk mengcopy

#### Menghapus setiap kolom yang NaN / missing value

In [24]:
df = df.dropna(axis='columns')
df.head()

            Z
0  OMJZv5Hlpd
1  hb39Oc2EAE
2  VUzaIaqpVp
3  yvCqamhMAR
4  kowiYpC0An

`df.dropna()` : digunakan untuk menghapus data yang tidak ada value

#### Menghapus setiap baris yang mengandung missing value

In [25]:
df = df_backup.copy(deep=True) # digunakan untuk mengembalikan data
df = df.dropna(axis='rows')
df.head()

            Z         A         B         C         D
0  OMJZv5Hlpd -0.369576  0.282193 -0.152119  0.096821
3  yvCqamhMAR  0.544578  0.626010 -0.594372  0.816455
4  kowiYpC0An -0.044419  0.911803  0.711267  2.145084
6  smp7hpRYwT  0.026884 -0.596464 -0.520816  1.323952
7  904DiaKhlz  0.800219  1.367005  1.719604 -0.176834

#### Presentase Missing Value untuk tiap kolom

In [26]:
df = df_backup.copy(deep=True) #mengembalikan data frame ke semula
df.isna().mean()

Z    0.000000
A    0.100000
B    0.133333
C    0.133333
D    0.033333
dtype: float64

- `df.isna()` : mengumpulkan setiap mising value (NaN)
- mean : menggunakan mendapatkan mean

#### Menghapus setiap kolom yang mengandung missing values berdasarkan threshold

In [29]:
treshold = len(df)*0.9 #data yang non mising valuenya dibawh 0.9
df = df.dropna(thresh = treshold,axis='columns')
df.head()

            Z         A         D
0  OMJZv5Hlpd -0.369576  0.096821
1  hb39Oc2EAE       NaN  0.608914
2  VUzaIaqpVp       NaN -0.915022
3  yvCqamhMAR  0.544578  0.816455
4  kowiYpC0An -0.044419  2.145084

- `treshold` : ambang batas
- `len(df)` : menghitung banyak data frame
- `thresh` : untuk treshold

#### Memeriksa kesamaan antar kolom (series)

https://youtu.be/5QPrlQ9UE3Q

#### Data Frame Awal

In [31]:
data = {'A':[15,15,18,np.nan,12],'B':[15,15,18,np.nan,12]}
df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

#### Mengenal Pandas Series

In [32]:
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [33]:
type(df['A'])

pandas.core.series.Series

In [34]:
type(df)

pandas.core.frame.DataFrame

- series pada dasarnya adalah kolom 
- tiap kolom pasti punya tipe data series.

#### Memerikasa kesamaan dengan opertator ==

In [36]:
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

- setiap baris akan di bandingkan 
- untuk baris yang missing value maka akan hasilnya false bila ingin membandingkan nilai sebaiknya tidak menggunakan operator ini

#### menggunakan method equals()

In [38]:
df['A'].equals(df['B'])

True

bila untuk mencari tau 2 nilai data itu sama atau tidak, lebih baik menggunakan equals

#### memeriksa antar dua frame

In [41]:
df1 = df.copy(deep=True) # mengduplikat dataframe awal
df.equals(df1)

True

In [42]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True

hasil operator dan hasil method `equals()`, memberikan hasil yang berbeda karena ada kegunaan yang berbeda.